<template>
  <div>
    <h2>FAQ</h2>
    <v-expansion-panels>
      <v-expansion-panel>
        <v-expansion-panel-header>Что такое огоньки?</v-expansion-panel-header>
        <v-expansion-panel-content>
          Огоньки - внутренняя валюта портала, используемая для поощрения наиболее инициативных сотрудников компании.
        </v-expansion-panel-content>
      </v-expansion-panel>

      <v-expansion-panel>
        <v-expansion-panel-header>Для чего нужны огоньки и как их получить?</v-expansion-panel-header>
        <v-expansion-panel-content>
          <ol>
            <li>Каждому сотруднику за вход в систему выдаётся по 1 огоньку 1 раз в день.</li>
            <li>Валюта может быть использована сотрудниками в качестве комплемента своим коллегам. Сотрудник выбирает качество коллеги, характеризующее его работу (компетентность, надежность, динамичность, командность, ответственность), и указывает количество огоньков для передачи.</li>
            <li>При внесении статьи в пункт «Предложения», сотруднику начисляются огоньки, в зависимости от типа статьи:
              решение проблемы - 50 огоньков, в случае, если же идея принимается ответственным подразделением (решение остается на сайте, но голосование закрывается) сотрудник получает общую сумму огоньков, равную количеству огоньков, которым проголосовали за его статью (блок предложения выделяется синим градиентом в зависимости от количества набранных огоньков).
              проблема – 25 огоньков, в случае же, если проблема признана сотрудниками актуальной (блок проблемы выделяется красным градиентом при 100 набранных огоньков), то огоньки набранные статьей и последующие начисляются автору.
            </li>
            <li>При написании статьи в пункте «Делимся опытом», пользователь получает фиксированную сумму – 50 огоньков + лайки за статью, конвертированные в огоньки в соотношении 1:1.</li>
            <li>Огоньки можно тратить во внутреннем магазине, где представлены различные мерчи, купоны и сертификаты от партнеров.</li>
            <li>В случае, когда пользователь проголосовал огоньками за решение проблемы, которое было принято ответственным подразделением к исполнению – пользователь получает удвоенное количество огоньков, инвестированных в статью.</li>
          </ol>
        </v-expansion-panel-content>
      </v-expansion-panel>

      <v-expansion-panel>
        <v-expansion-panel-header>Какие виды бейджей существуют?</v-expansion-panel-header>
        <v-expansion-panel-content>
          В личном профиле реализуется "наградная доска", где размещаются добытые сотрудником бэйджи. Бэйджи делятся на следующие уровни:
          <ul>
            <li>значок – показатель активности сотрудника на портале.</li>
            <li>медаль – показатель особой активности сотрудника на портале.</li>
            <li>орден – высшая награда, выдаваемая за выявление чрезвычайно важных проблем или предложение решения принесшее небывалую прибыль.</li>
          </ul>
          Особенности:
          <ul>
            <li>По каждому из бэйджей составляется рейтинг сотрудников. Каждый сотрудник может посмотреть свой рейтинг по данному бэйджу среди других сотрудников.</li>
            <li>Все бэйджи имеют дату присвоения. </li>
            <li>Значки накапливаются и по накоплению определённого количества значков выдаётся соответствующая медаль.</li>
            <li>Ордена кроме даты присвоения имеют поля описания, в котором содержится информация за что получен орден. </li>
          </ul>
        </v-expansion-panel-content>
      </v-expansion-panel>
  
      <v-expansion-panel>
        <v-expansion-panel-header>Какие есть значки, медали и ордена?</v-expansion-panel-header>
        <v-expansion-panel-content>
          Значки:
          <ul>
            <li>Передовик – автору 2 принятых актуальных решений. </li>
            <li>Исследователь – автору 4 актуальных проблем. </li>
            <li>Писатель – за 3 опубликованные статьи. </li>
            <li>Лидер офиса, Лидер филиала, Лидер компании – присваивается за лидерство среди сотрудников по написанным статьям.</li>
          </ul>

          Медали:
          <ul>
            <li>Локомотив -  5 раз получен значок «Передовик». </li>
            <li>Эйнштейн – 3 раза получен значок «Исследователь».</li>
            <li>Издатель – 10 раз получен значок «Писатель». </li>
          </ul>

          Ордена:
          <ul>
            <li>Спасатель - за выявление чрезвычайно важной проблемы банка (отдела).</li>
            <li>Оптимизатор - за реализованную идею, повлекшую рост показателей банка (отдела).</li>
          </ul>

        </v-expansion-panel-content>
      </v-expansion-panel>

      <v-expansion-panel>
        <v-expansion-panel-header>Присутствует ли элемент соревновательности?</v-expansion-panel-header>
        <v-expansion-panel-content>
          Для каждого отдела реализуется своя доска лидеров по огонькам. При нахождении сотрудника на доске лидеров от 2 месяцев и более, он перемещается на доску лидеров региона (при этом сравниваются количества огоньков сотрудников разных отделений банка в одном регионе). Также существует доска лидеров всего банка, куда попадает региональный лидер после нахождения на доске региональных лидеров от 2 месяцев и более.
        </v-expansion-panel-content>
      </v-expansion-panel>

      <v-expansion-panel>
        <v-expansion-panel-header>Существует ли поощрение для самого инициативного отдела, филиала?</v-expansion-panel-header>
        <v-expansion-panel-content>
          Да, существует переходящий флаг. Под флагом понимается внесение изменений в дизайн портала для конкретного отдела (не координально, добавляются элементы «премиальности» в оформление, например рамка для фото у каждого сотрудника отдела и т.п.). Таковое совершается ежеквартально после сравнения показателей активности на портале между всеми одинаковыми по функционалу отделами банка. Общая активность оценивается по совокупному количеству добытых огоньков. 
        </v-expansion-panel-content>
      </v-expansion-panel>
    </v-expansion-panels>
  </div>
</template>