<template>
    <sliderMain />
</template>


<script>
import sliderMain from './sliderMain.vue'
export default {
    components: {
        sliderMain
    },
    data() {
    return {
      events: [
        {
          title: "Sustainability. To be or not to be - Устоять или вырасти",
          text: '25 июня 2020 года пройдет Технопарк "Сколково" проведет онлайн-встречу «Sustainability. To be or not to be - Устоять или вырасти», которая будет посвящена достижению целей устойчивого развития в эпоху пандемии и выходу компаний из карантина.',
          date: "25.06.2020",
          src:"https://s0.rbk.ru/v6_top_pics/media/img/5/81/755817089384815.jpeg"
        },
        {
          title: "Российский Энергетический Саммит 2020",
          text: "3-4 июня в Москве пройдет III Российский энергетический саммит «Энергоснабжение и цифровизация» - специализированная площадка для ключевых игроков энергетической отрасли. Саммит был перенесен из-за пандемии коронавируса.",
          date: "09.09.2020 - 10.09.2020",
          src:"https://www.gazprom-neft.ru/upload/iblock/687/SHI_8110(1).jpg"
        },
        {
          title: "ПЛАС-Форум Online & Offline Retail",
          text: "Международный ПЛАС-Форум ‘Online & Offline Retail’, организуемый журналами ПЛАС и Retail&Loyalty, - ключевое мероприятие для ритейла в России, странах ближнего и дальнего зарубежья.Формат проведения ПЛАС-Форума: выставка, конференция, круглые столы.",
          date: "07.10.2020 - 08.10.2020",
          src: "https://s0.rbk.ru/v6_top_pics/media/img/5/81/755817089384815.jpeg"
        },
        {
          title: "Системы искусственного интеллекта 2020 (новая дата)",
          text: "Разработка решений на базе искусственного интеллекта (ИИ) входит в число ключевых приоритетов крупнейших ИТ-разработчиков. Эта технология также становится неотъемлемой частью корпоративных стратегий и её применяют все большее количество компаний. Интеллектуальные решения способствуют повышению эффективности работы сотрудников.",
          date: "21.10.2020",
          src: "https://www.gazprom-neft.ru/upload/iblock/687/SHI_8110(1).jpg"
        },
        {
          title: "Платежный бизнес 2020 (перенесен)",
          text: "Информируем Вас, что проведение 11-го Международного ПЛАС-Форума «Платежный бизнес 2020» переносится на 18-19 ноября в связи с общей ситуацией, сложившейся в результате коронавирусой пандемии.",
          date: "18.11.2020 - 19.11.2020",
          src: "https://s0.rbk.ru/v6_top_pics/media/img/5/81/755817089384815.jpeg"
        },
        {
          title: "Банковское самообслуживание, ритейл и НДО 2020",
          text:  "ПЛАС-Форум -это экспертная площадка индустрии платежных и финансовых услуг.Форум посвящен современному состоянию и перспективам развития наличного денежного обращения (НДО), банкинга и платежной индустрии в России, в государствах – членах ЕАЭС и других странах мира.",
          date: "18.11.2020 - 19.11.2020",
          src: "https://www.gazprom-neft.ru/upload/iblock/687/SHI_8110(1).jpg"
        }
      ]
    };
  }
};
</script>

